### Traiter les valeurs manquantes

#### inroduction du dataset

In [3]:
import pandas as pd

In [6]:
titanic = pd.read_csv("titanic_survival.csv")
titanic.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1.0,1.0,"Allen, Miss. Elisabeth Walton",female,29.0000,0.0,0.0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1.0,1.0,"Allison, Master. Hudson Trevor",male,0.9167,1.0,2.0,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1.0,0.0,"Allison, Miss. Helen Loraine",female,2.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1.0,0.0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1.0,0.0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

### Trouver les valeurs manquantes

In [11]:
# pandas.isnull()
sex = titanic["sex"]
sex_is_null = pd.isnull(sex)
print(sex_is_null)
sex_null = sex[sex_is_null]
print(sex_null)

0       False
1       False
2       False
3       False
4       False
        ...
1305    False
1306    False
1307    False
1308    False
1309     True
Name: sex, Length: 1310, dtype: bool
1309    NaN
Name: sex, dtype: object

- Compter le nombre de valeus dans la colonne "age" possédant des valeurs manquantes:
    - Assigner à la variable age de la colonne les ages du dataset
    - Utiliser pandas.isnull() sur la variable pour créer une série de valeurs True False
    - Utiliser la series resultante pour sélectionner seulement les élements de la colonne "Ages qui sont nuls
      et assigner le résultat à la variable age_null
    - Assigner le nombre de valeurs manquantes de age_null à la variable age_null_count (focntion len()
- Affihcer age_null_count pour voir le nomnbre de valeur manquantes de la colonnes "age"

In [14]:
age = titanic["age"]
age_is_null = age.isnull()
age_null = age[age_is_null]
age_null_count = len(age_null)
print(age_null_count)

264

### Probléme avec les valeus manquantes

In [16]:
# un calcul avec un valeur manquante retournera une valeur manquante

- Utiliser age_is_null pour créer un vecteur qui contient seulement les valeurs de la colonne "age" qui ne sont
  pas NaN (c'est à dire pour lesquelles ages_is_null vaut False)
- Assigner ce résultat à la variable good_ages
- Calculer la moyenne de ce nouveau vecteur  et assigner le résultat à la variable mean_age
- Afficher cette moyenne

In [20]:
good_age = titanic["age"][age_is_null == False]
mean_age = sum(good_age) / len(good_age)
print(mean_age)

29.8811345124283

### Calculer la moeyenne plus simplement

In [22]:
# series.mean()
mean_age2 = titanic["age"].mean()
print(mean_age2)

29.8811345124283

- Assigner la moyenne de la colonne "fare" à la variable mean_fare
- Afficher le résultat

In [23]:
mean_fare = titanic["fare"].mean()
print(mean_fare)

33.29547928134572

### Calculer des statistiques de prix
- Creer un dictionnaire vide qu'on nommera fares_by_class
- Creer la liste passenger_classes qui contient les éléments [1,2,3]
- Utiliser une boucle for pour parcourire la liste passenger_classes:
    - Sélectionner juste les lignes de titanic_survival pour lesquelles la colonne pclass est égale à la
      variable temporaire (l'itérateur) de la boucle for, càd correspondant au numéro de classe (1,2,3)
    - Sélectionner seulement la colonne fare pour ce sous ensemble de lignes (correspondant à la classe)
    - Utiliser la méthode serie.mean() pour calculer la moyenne de ce sous ensemble
    - Ajouter cette moyenne calculée de la classe au dictionnaire fares_by_clas avec comme clés le numéro
      de la classe (et donc comme valeur moeynne du prix du billet d'embarquement)
- Une fois la boucle achevé, le dictionnaire fare_by_class devrait avoir 1,2, et 3 comme clés avec en valeur les moyennes correpondantes
- affciher le résultat

In [31]:
fare_by_class = {}
passenger_classes = [1,2,3]

for pclass in passenger_classes:
    pclass_row = titanic[titanic["pclass"] == pclass]
    pclass_fares = pclass_row["fare"]
    fare_for_class = pclass_fares.mean()
    fare_by_class[pclass] = fare_for_class
print(fare_by_class)

{1: 87.50899164086687, 2: 21.1791963898917, 3: 13.302888700564957}

### inroduction au pivots de table

In [46]:
# dataset.pivot_table()
import numpy as np
# index qu'elle colonne on veut grouper
# values colonne ou on applique le calcul
# calcul que l'on veu appliqué par defaut mean
passenger_class_fare = titanic.pivot_table(index= "pclass", values="fare", aggfunc=np.mean)
print(round(passenger_class_fare, 2))

         fare
pclass
1.0     87.51
2.0     21.18
3.0     13.30

- Utiliser la méthode dataset.pivot_table() pour calculer la moyenne de l'âge pour chaque classe de passager
- Assigner ke résultat à la variable passenger_age
- Affciher passenger_age
- Faire de même avec la colonne survived pour chaque classe de passager.

In [45]:
passenger_age = titanic.pivot_table(index= "pclass", values="age")
print(round(passenger_age, 2))

          age
pclass
1.0     39.16
2.0     29.51
3.0     24.82

In [44]:
passenger_survived = titanic.pivot_table(index= "pclass", values="survived")
print(round(passenger_survived, 2))

        survived
pclass
1.0         0.62
2.0         0.43
3.0         0.26

### Table Pivot Niveau 2

- Faire un pivot de table qui calcule le total d'argent encaiser ("fare") et le nombre total de survivant pour
  chaque port d'embarcation ("embarked"). il faudra utiliser la np.sim
- Assigner le résultat à la variable port_stats
- Afficher le résultat

In [49]:
port_stats = titanic.pivot_table(index="embarked", values=["fare", "survived"], aggfunc= np.sum)
print(port_stats)

                fare  survived
embarked
C         16830.7922     150.0
Q          1526.3085      44.0
S         25033.3862     304.0

### Eliminier les valeur manquantes

In [52]:
### dataset.dropna(axis= 0 ou axis ='index') pour les lignes ou dataset.dropna(axis=1) pour les colonnes
# Vire tout pas terrible

In [53]:
# dropna(axis= ...., subset=["name"])
titanic.dropna(axis=0 , subset=["name"])

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1.0,1.0,"Allen, Miss. Elisabeth Walton",female,29.0000,0.0,0.0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1.0,1.0,"Allison, Master. Hudson Trevor",male,0.9167,1.0,2.0,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1.0,0.0,"Allison, Miss. Helen Loraine",female,2.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1.0,0.0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1.0,0.0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1304,3.0,0.0,"Zabour, Miss. Hileni",female,14.5000,1.0,0.0,2665,14.4542,NaN,C,NaN,328.0,NaN
1305,3.0,0.0,"Zabour, Miss. Thamine",female,NaN,1.0,0.0,2665,14.4542,NaN,C,NaN,NaN,NaN
1306,3.0,0.0,"Zakarian, Mr. Mapriededer",male,26.5000,0.0,0.0,2656,7.2250,NaN,C,NaN,304.0,NaN
1307,3.0,0.0,"Zakarian, Mr. Ortin",male,27.0000,0.0,0.0,2670,7.2250,NaN,C,NaN,NaN,NaN
1308,3.0,0.0,"Zimmerman, Mr. Leo",male,29.0000,0.0,0.0,315082,7.8750,NaN,S,NaN,NaN,NaN

### Eliminer les valeurs manquantes
- Supprimer toutes les lignes pour lesquelles les colonnes "ages" ou "sex" ont des valeurs manquantes et 
  assigner le résultat à la variable new_titanic.
- Comparer le nombres de lignes qu'il reste avec shape

In [60]:
new_titanic = titanic.dropna(axis= 0, subset=["age", "sex"])
print(new_titanic.shape)

(1046, 14)

### iloc pour accéder  à des lignes

In [62]:
# dataset.moc[] pour les position
new_titanic = titanic.sort_values("age", inplace= False, ascending = False)
new_titanic

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
14,1.0,1.0,"Barkworth, Mr. Algernon Henry Wilson",male,80.0,0.0,0.0,27042,30.0000,A23,S,B,NaN,"Hessle, Yorks"
61,1.0,1.0,"Cavendish, Mrs. Tyrell William (Julia Florence...",female,76.0,1.0,0.0,19877,78.8500,C46,S,6,NaN,"Little Onn Hall, Staffs"
1235,3.0,0.0,"Svensson, Mr. Johan",male,74.0,0.0,0.0,347060,7.7750,NaN,S,NaN,NaN,NaN
135,1.0,0.0,"Goldschmidt, Mr. George B",male,71.0,0.0,0.0,PC 17754,34.6542,A5,C,NaN,NaN,"New York, NY"
9,1.0,0.0,"Artagaveytia, Mr. Ramon",male,71.0,0.0,0.0,PC 17609,49.5042,NaN,C,NaN,22.0,"Montevideo, Uruguay"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1297,3.0,0.0,"Wiseman, Mr. Phillippe",male,NaN,0.0,0.0,A/4. 34244,7.2500,NaN,S,NaN,NaN,NaN
1302,3.0,0.0,"Yousif, Mr. Wazli",male,NaN,0.0,0.0,2647,7.2250,NaN,C,NaN,NaN,NaN
1303,3.0,0.0,"Yousseff, Mr. Gerious",male,NaN,0.0,0.0,2627,14.4583,NaN,C,NaN,NaN,NaN
1305,3.0,0.0,"Zabour, Miss. Thamine",female,NaN,1.0,0.0,2665,14.4542,NaN,C,NaN,NaN,NaN
1309,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [63]:
new_titanic.loc[0]

pclass                                   1
survived                                 1
name         Allen, Miss. Elisabeth Walton
sex                                 female
age                                     29
sibsp                                    0
parch                                    0
ticket                               24160
fare                               211.338
cabin                                   B5
embarked                                 S
boat                                     2
body                                   NaN
home.dest                     St Louis, MO
Name: 0, dtype: object

In [64]:
# dataset.iloc[] pour les intitule de lignes
new_titanic.iloc[0:5]

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
14,1.0,1.0,"Barkworth, Mr. Algernon Henry Wilson",male,80.0,0.0,0.0,27042,30.0000,A23,S,B,NaN,"Hessle, Yorks"
61,1.0,1.0,"Cavendish, Mrs. Tyrell William (Julia Florence...",female,76.0,1.0,0.0,19877,78.8500,C46,S,6,NaN,"Little Onn Hall, Staffs"
1235,3.0,0.0,"Svensson, Mr. Johan",male,74.0,0.0,0.0,347060,7.7750,NaN,S,NaN,NaN,NaN
135,1.0,0.0,"Goldschmidt, Mr. George B",male,71.0,0.0,0.0,PC 17754,34.6542,A5,C,NaN,NaN,"New York, NY"
9,1.0,0.0,"Artagaveytia, Mr. Ramon",male,71.0,0.0,0.0,PC 17609,49.5042,NaN,C,NaN,22.0,"Montevideo, Uruguay"

### iloc pour accéder au lignes
- Assigner les 10 1er lignes de new_titanic à la variable first_ten_rows
- Assigner la 5 eme lignes de new_titanic à la variable row_position_five
- Assigner la ligne dont l'intitulé d'index est 25 pour new_titanic à la variable row_index_25

In [74]:
first_ten_rows = new_titanic.iloc[0:10]
row_postion_five = new_titanic.iloc[5]
row_index_25 = new_titanic.iloc[25]

### Les index de colonne

In [68]:
new_titanic.iloc[0,0]

1.0

In [69]:
new_titanic.iloc[:,0:3]

      pclass  survived                                               name
14       1.0       1.0               Barkworth, Mr. Algernon Henry Wilson
61       1.0       1.0  Cavendish, Mrs. Tyrell William (Julia Florence...
1235     3.0       0.0                                Svensson, Mr. Johan
135      1.0       0.0                          Goldschmidt, Mr. George B
9        1.0       0.0                            Artagaveytia, Mr. Ramon
...      ...       ...                                                ...
1297     3.0       0.0                             Wiseman, Mr. Phillippe
1302     3.0       0.0                                  Yousif, Mr. Wazli
1303     3.0       0.0                              Yousseff, Mr. Gerious
1305     3.0       0.0                              Zabour, Miss. Thamine
1309     NaN       NaN                                                NaN

[1310 rows x 3 columns]

In [70]:
new_titanic.loc[83, "age"]

64.0

In [71]:
new_titanic.loc[766, "pclass"]

3.0

- Assigner la valeur d'intilue de la ligne 1100 pour la colonne"age" à la variable row_index_1100_age
- Assigner la valeut d'intilue de la ligne 25 pour la colonne "survived" à la variable row_index_25_survived
- Assigner les 5 1er lignes et 3 1er colonnes à la variable five_rows_three_cols
- Afficher les résultats

In [73]:
row_index_1100_age = new_titanic.loc[1100, "age"]
row_index_25_survived = new_titanic.loc[25, "survived"]
five_rows_three_cols = new_titanic.iloc[0:5, 0:3]
print(row_index_1100_age)
print(row_index_25_survived)
print(five_rows_three_cols)

29.0
0.0
      pclass  survived                                               name
14       1.0       1.0               Barkworth, Mr. Algernon Henry Wilson
61       1.0       1.0  Cavendish, Mrs. Tyrell William (Julia Florence...
1235     3.0       0.0                                Svensson, Mr. Johan
135      1.0       0.0                          Goldschmidt, Mr. George B
9        1.0       0.0                            Artagaveytia, Mr. Ramon

### Réindexer les lignes d'un dataframe
- Ré-indexer le dataframe new_titanic_survival pour que la première ligne commence à 0 et supprimer l'ancien indexage.
- Assigner le résultat à la variable titanic_reindexed.
- Afficher les 5 premières lignes et 3 premières colonnes de titanic_reindexed.

In [75]:
# DataFrame.reset_index(drop=True) drop pour enlevé l'ancienne colonne
new_titanic_index = new_titanic
titanic_reindex = new_titanic_index.reset_index(drop=True)
titanic_reindex.iloc[0:5,0:3]

   pclass  survived                                               name
0     1.0       1.0               Barkworth, Mr. Algernon Henry Wilson
1     1.0       1.0  Cavendish, Mrs. Tyrell William (Julia Florence...
2     3.0       0.0                                Svensson, Mr. Johan
3     1.0       0.0                          Goldschmidt, Mr. George B
4     1.0       0.0                            Artagaveytia, Mr. Ramon

In [77]:
# cours appliquer une fonction
# Dataset.apply()
# une foncion qui retourne le 100e element
def row_100(column):
    # extraire le 100 eme elem
    item = column.iloc[99]
    return item

In [79]:
# retourne le 100 eme elem
row_100_var = titanic.apply(row_100)
row_100_var

pclass                                                       1
survived                                                     1
name         Duff Gordon, Lady. (Lucille Christiana Sutherl...
sex                                                     female
age                                                         48
sibsp                                                        1
parch                                                        0
ticket                                                   11755
fare                                                      39.6
cabin                                                      A16
embarked                                                     C
boat                                                         1
body                                                       NaN
home.dest                                       London / Paris
dtype: object

### Appliquer des fonctions sur un DataFrame
- Ecrire une fonction qui compte le nombre d'éléments manquants d'un objet Series.
- Utiliser la méthode DataFrame.apply() pour appliquer votre fonction sur titanic_survival.
- Assigner le résultat  à la variable column_null_count.
- Afficher le résultat.

In [82]:
def elem_manquant(column):
    column_null = pd.isnull(column)
    null = column[column_null]
    return len(null)
column_null_count = titanic.apply(elem_manquant)
print(column_null_count)

pclass          1
survived        1
name            1
sex             1
age           264
sibsp           1
parch           1
ticket          1
fare            2
cabin        1015
embarked        3
boat          824
body         1189
home.dest     565
dtype: int64

In [86]:
# Cours appliquer une fonction à une ligne
# Dataset.apply(function, axis = 1)
def is_mino(row):
    if row["age"] < 18:
        return True
    else:
        return False
minor = titanic.apply(is_mino, axis=1)
minor

def which_class(row):
    pclass = row["pclass"]
    if pd.isnull(pclass):
        return "unknow"
    elif pclass == 1:
        return "First Class"
    elif pclass == 2:
        return "Second Class"
    else:
        return "Third Class"
    
classe = titanic.apply(which_class, axis =1)
classe

0       First Class
1       First Class
2       First Class
3       First Class
4       First Class
           ...
1305    Third Class
1306    Third Class
1307    Third Class
1308    Third Class
1309         unknow
Length: 1310, dtype: object

### Appliquer une fonction à une ligne
- Créer une fonction qui retourne la chaine de caractères "minor" pour quelqu'un de moins de 18 ans, "adult" si son age est supérieur ou égal à 18 et "unknown" si la valeur est manquante.
- utiliser cette fonction avec la méthode apply() pour trouver l'intitulé correct pour chaque apssager du dataframe titanic_survival.
- Assigner le résultat à la variable age_labels.
- Afficher le résultat.

In [88]:
def minor(row):
    age = row["age"]
    if pd.isnull(age):
        return "Unknow"
    elif age > 18:
        return "Adult"
    else:
        return "Minor"
age_lables = titanic.apply(minor, axis =1)
print(age_lables)

0        Adult
1        Minor
2        Minor
3        Adult
4        Adult
         ...
1305    Unknow
1306     Adult
1307     Adult
1308     Adult
1309    Unknow
Length: 1310, dtype: object

### Pratique: Calculer le pourcentage de survie par groupe d'âge
- Ajouter la colonne "age_labels" au dataframe titanic_survival contenant la variable age_labels qu'on a créé dans la vidéo précédente.
- Créer une table pivot qui calcule la moyenne de chance de survie (colonne "survived") pour chaque groupe d'âge (colonne "age_labels") du dataframe titanic_survival.
- Assigner l'objet Series résultant à la variable age_group_survival.
- Afficher le résultat.

In [90]:
titanic["age_labels"] = age_lables
age_group_surival = titanic.pivot_table(index="age_labels", values="survived")
print(age_group_surival)

            survived
age_labels
Adult       0.389215
Minor       0.492228
Unknow      0.277567